app/controllers/deposits_controller.rb

SELECT "deposits".* FROM "deposits" WHERE "deposits"."tradeline_id" = ?  [["tradeline_id", 1]]
SELECT "tradelines".* FROM "tradelines" WHERE "tradelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    render json: Tradeline.find(params[:tradeline_id]).deposits

SELECT "deposits".* FROM "deposits" WHERE "deposits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Deposit.find(params[:id])

INSERT INTO "deposits" ("deposit_date", "amount", "tradeline_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["deposit_date", "2024-04-13"], ["amount", 10.56], ["tradeline_id", 1], ["created_at", "2024-04-05 20:38:27.479224"], ["updated_at", "2024-04-05 20:38:27.479224"]]
---
  def create
    begin
      @deposit = Deposit.new(deposit_params)
      @deposit.save!