app/controllers/tradelines_controller.rb

SELECT "deposits".* FROM "deposits" WHERE "deposits"."tradeline_id" IN (?, ?)  [["tradeline_id", 1], ["tradeline_id", 2]]
SELECT "tradelines".* FROM "tradelines"
---
  def index
    @tradelines = Tradeline.includes(:deposits)

SELECT "tradelines".* FROM "tradelines" WHERE "tradelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tradeline = Tradeline.find(params[:id])